# Код Морзе для представления цифр и букв использует тире и точки. Напишите функцию для кодирования текстового сообщения
# в соответствии с кодом Морзе.
def morze_convert(text: str):
    morze_dict = {'a': '.-',
                  'b': '-...',
                  'c': '-.-.',
                  'd': '-..',
                  'e': '.',
                  'f': '..-.',
                  'g': '--.',
                  'h': '....',
                  'i': '..',
                  'j': '.---',
                  'k': '-.-',
                  'l': '.-..',
                  'm': '--',
                  'n': '-.',
                  'o': '---',
                  'p': '.--.',
                  'q': '--.-',
                  'r': '.-.',
                  's': '...',
                  't': '-',
                  'u': '..-',
                  'v': '...-',
                  'w': '.--',
                  'x': '-..-',
                  'y': '-.--',
                  'z': '--..',
                  '1': '.----',
                  '2': '..---',
                  '3': '...--',
                  '4': '....-',
                  '5': '.....',
                  '6': '-....',
                  '7': '--...',
                  '8': '---..',
                  '9': '----.',
                  }
    morze_text = ''
    for i in text.lower():
        morze_text += morze_dict.get(i, ' ') + ' '
    return morze_text
